// arr = ["ПН","ВТ","СР","ЧТ","ПТ","СБ","ВС"]
// alert (arr[0] + " и " + arr[4]+ " Экзамен")
// arr = ["Женя","Саша","Миша","Дана","Вова","получят","подарок","не"]
// alert (arr[0] +" " + arr[3] + " и " + arr[4] + " " + arr[5] + " " + arr[6])
// alert (arr[1] + " и " + arr[2] + " " + arr[7] + " " + arr[5] + " " + arr[6])
// obj ={"Женя":"20000","Дана":"45000","Богдан":"30000"}
// alert(obj["Богдан"])
// arr = {
//     "Женя":["10000","15000","20000"],
//     "Саша":["100000","150000","200000","350000"]
// }
// alert(arr["Саша"] [3])
// arr = {
//     "Мальчики":["Вова","Женя","Бодя"],
//     "Девочки":["Рита","Нина","Соня"]
// }
// alert(arr["Мальчики"][1] +" "+ arr["Девочки"][1] +" "+ arr["Мальчики"][0])
let x = 1
let arr = [ 2, 3, 4, 5]
for(i = 0; i < 4; i++)
{
    x = x * arr[i]
}
alert(x)